---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.OriginOffsetX
source: html/f9393938-c372-3ac2-354e-68ec25ca3ecc.htm
---
# Autodesk.Revit.DB.PrintParameters.OriginOffsetX Property

The User defined X value of offset from left bottom corner. Unit is feet.

## Syntax (C#)
```csharp
public double OriginOffsetX { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown if PaperPlacement is not Margins and MarginType is not User defined type.